mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/s6e2c4xh.svd
        <!-- REGISTER "PPG_PRLL" -->
        <register>
          <name>PPG_PRLL</name>
          <description>LOW Width Reload Register [HW]</description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "PPG_PRLH" -->
        <register>
          <name>PPG_PRLH</name>
          <description>HIGH Width Reload Register [HW]</description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "PPG_TMR" -->
        <register>
          <name>PPG_TMR</name>
          <description>Timer Register [BHW]</description>
          <alternateGroup>PPG</alternateGroup>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "RT_TMCR" -->
        <register>
          <name>RT_TMCR</name>
          <description>Timer Control Register [BHW]</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS" -->
            <field>
              <name>CKS</name>
              <description>Count clock selection bit</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description>Trigger input edge selection bits</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "T32" -->
            <field>
              <name>T32</name>
              <description>32-bit timer selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description>Timer function selection bits</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSEL" -->
            <field>
              <name>OSEL</name>
              <description>Output polarity specification bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description>Mode selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description>Timer enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STRG" -->
            <field>
              <name>STRG</name>
              <description>Software trigger bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_TMCR2" -->
        <register>
          <name>RT_TMCR2</name>
          <description>Timer Control Register 2 [BHW]</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GATE" -->
            <field>
              <name>GATE</name>
              <description>Gate Input Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description>Count clock selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_STC" -->
        <register>
          <name>RT_STC</name>
          <description>Status Control Register [BHW]</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGIE" -->
            <field>
              <name>TGIE</name>
              <description>Trigger interrupt request enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIE" -->
            <field>
              <name>UDIE</name>
              <description>Underflow interrupt request enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TGIR" -->
            <field>
              <name>TGIR</name>
              <description>Trigger interrupt request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UDIR" -->
            <field>
              <name>UDIR</name>
              <description>Underflow interrupt request bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RT_PCSR" -->
        <register>
          <name>RT_PCSR</name>
          <description>Cycle Set Register [HW]</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
