mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/s6e2c4xh.svd
        <!-- REGISTER "I2C_FBYTE2" -->
        <register>
          <name>I2C_FBYTE2</name>
          <description>FIFO Byte Register 2 [BHW]</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FD" -->
            <field>
              <name>FD</name>
              <description>data count in FIFO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_NFCR" -->
        <register>
          <name>I2C_NFCR</name>
          <description>Noise Filter Control Register [BHW]</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NFT" -->
            <field>
              <name>NFT</name>
              <description>Noise Filter Time Select bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "I2C_EIBCR" -->
        <register>
          <name>I2C_EIBCR</name>
          <description>Extension I2C Bus Control Register [BHW]</description>
          <alternateGroup>I2C</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SDAS" -->
            <field>
              <name>SDAS</name>
              <description>SDA status bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCLS" -->
            <field>
              <name>SCLS</name>
              <description>SCL status bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SDAC" -->
            <field>
              <name>SDAC</name>
              <description>SDA output control bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCLC" -->
            <field>
              <name>SCLC</name>
              <description>SCL output control bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOCE" -->
            <field>
              <name>SOCE</name>
              <description>Serial output enabled bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description>Bus error control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "MFS1" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS1</name>
      <baseAddress>0x40038100</baseAddress>
      <description>Multi-function Serial Interface 1</description>
      <version>B</version>
      <!-- INTERRUPT "MFS1_RX" -->
      <interrupt>
        <name>MFS1_RX</name>
        <value>62</value>
      </interrupt>
      <!-- INTERRUPT "MFS1_TX" -->
      <interrupt>
        <name>MFS1_TX</name>
        <value>63</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS2" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS2</name>
      <baseAddress>0x40038200</baseAddress>
      <description>Multi-function Serial Interface 2</description>
      <version>B</version>
      <!-- INTERRUPT "MFS2_RX" -->
      <interrupt>
        <name>MFS2_RX</name>
        <value>64</value>
      </interrupt>
      <!-- INTERRUPT "MFS2_TX" -->
      <interrupt>
        <name>MFS2_TX</name>
        <value>65</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS3" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS3</name>
      <baseAddress>0x40038300</baseAddress>
      <description>Multi-function Serial Interface 3</description>
      <version>B</version>
      <!-- INTERRUPT "MFS3_RX" -->
      <interrupt>
        <name>MFS3_RX</name>
        <value>66</value>
      </interrupt>
      <!-- INTERRUPT "MFS3_TX" -->
      <interrupt>
        <name>MFS3_TX</name>
        <value>67</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS4" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS4</name>
      <baseAddress>0x40038400</baseAddress>
      <description>Multi-function Serial Interface 4</description>
      <version>B</version>
      <!-- INTERRUPT "MFS4_RX" -->
      <interrupt>
        <name>MFS4_RX</name>
        <value>68</value>
      </interrupt>
      <!-- INTERRUPT "MFS4_TX" -->
      <interrupt>
        <name>MFS4_TX</name>
        <value>69</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS5" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS5</name>
      <baseAddress>0x40038500</baseAddress>
      <description>Multi-function Serial Interface 5</description>
      <version>B</version>
      <!-- INTERRUPT "MFS5_RX" -->
      <interrupt>
        <name>MFS5_RX</name>
        <value>70</value>
      </interrupt>
      <!-- INTERRUPT "MFS5_TX" -->
      <interrupt>
        <name>MFS5_TX</name>
        <value>71</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "MFS6" -->
    <peripheral derivedFrom="MFS0">
      <name>MFS6</name>
      <baseAddress>0x40038600</baseAddress>
      <description>Multi-function Serial Interface 6</description>
      <version>B</version>
      <!-- INTERRUPT "MFS6_RX" -->
      <interrupt>
        <name>MFS6_RX</name>
        <value>72</value>
      </interrupt>
      <!-- INTERRUPT "MFS6_TX" -->
      <interrupt>
        <name>MFS6_TX</name>
        <value>73</value>
      </interrupt>
    </peripheral>
