mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/s6e2c4xh.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2SPRE" -->
    <peripheral>
      <name>I2SPRE</name>
      <description>I2S Clock Generation</description>
      <version>A</version>
      <groupName>I2SPRE</groupName>
      <baseAddress>0x4003D000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x28</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "TIM" -->
      <interrupt>
        <name>TIM</name>
        <value>59</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "ICCR" -->
        <register>
          <name>ICCR</name>
          <description>I2S Clock Control Register [BHW]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICSEL" -->
            <field>
              <name>ICSEL</name>
              <description>I2S clock selection bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "I2SEN" -->
            <field>
              <name>I2SEN</name>
              <description>I2S clock output enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR1" -->
        <register>
          <name>IPCR1</name>
          <description>I2S-PLL Control Register 1 [BHW]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLEN" -->
            <field>
              <name>IPLLEN</name>
              <description>I2S-PLL oscillation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR2" -->
        <register>
          <name>IPCR2</name>
          <description>I2S-PLL Control Register 2 [BHW]</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPOWT" -->
            <field>
              <name>IPOWT</name>
              <description>I2S-PLL oscillation stabilization wait time setting bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR3" -->
        <register>
          <name>IPCR3</name>
          <description>I2S-PLL Control Register 3 [BHW]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLK" -->
            <field>
              <name>IPLLK</name>
              <description>Frequency division ratio (K) setting bits of the I2S-PLL clock</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR4" -->
        <register>
          <name>IPCR4</name>
          <description>I2S-PLL Control Register 4 [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLN" -->
            <field>
              <name>IPLLN</name>
              <description>Frequency division ratio (N) setting bits of the I2S-PLL clock</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IP_STR" -->
        <register>
          <name>IP_STR</name>
          <description>I2S-PLL Status Register [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPRDY" -->
            <field>
              <name>IPRDY</name>
              <description>I2S-PLL oscillation stabilization bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_ENR" -->
        <register>
          <name>IPINT_ENR</name>
          <description>I2S-PLL Interrupt Factor Enable Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSE" -->
            <field>
              <name>IPCSE</name>
              <description>I2S-PLL oscillation stabilization wait complete interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_CLR" -->
        <register>
          <name>IPINT_CLR</name>
          <description>I2S-PLL Interrupt Factor Status Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSC" -->
            <field>
              <name>IPCSC</name>
              <description>I2S-PLL interrupt factor status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPINT_STR" -->
        <register>
          <name>IPINT_STR</name>
          <description>I2S-PLL Interrupt Factor Clear Register [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPCSI" -->
            <field>
              <name>IPCSI</name>
              <description>I2S-PLL oscillation stabilization interrupt factor clear bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IPCR5" -->
        <register>
          <name>IPCR5</name>
          <description>I2S-PLL Control Register 5 [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IPLLM" -->
            <field>
              <name>IPLLM</name>
              <description>Frequency division ratio (M) setting bits of the I2S-PLL clock</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
