mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xh/s6e2c4xh.svd
        <!-- REGISTER "TXBCF" -->
        <register>
          <name>TXBCF</name>
          <description>Tx Buffer Cancellation Finished [BHW]</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CF31" -->
            <field>
              <name>CF31</name>
              <description>Cancellation Finished of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF30" -->
            <field>
              <name>CF30</name>
              <description>Cancellation Finished of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF29" -->
            <field>
              <name>CF29</name>
              <description>Cancellation Finished of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF28" -->
            <field>
              <name>CF28</name>
              <description>Cancellation Finished of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF27" -->
            <field>
              <name>CF27</name>
              <description>Cancellation Finished of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF26" -->
            <field>
              <name>CF26</name>
              <description>Cancellation Finished of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF25" -->
            <field>
              <name>CF25</name>
              <description>Cancellation Finished of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF24" -->
            <field>
              <name>CF24</name>
              <description>Cancellation Finished of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF23" -->
            <field>
              <name>CF23</name>
              <description>Cancellation Finished of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF22" -->
            <field>
              <name>CF22</name>
              <description>Cancellation Finished of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF21" -->
            <field>
              <name>CF21</name>
              <description>Cancellation Finished of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF20" -->
            <field>
              <name>CF20</name>
              <description>Cancellation Finished of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF19" -->
            <field>
              <name>CF19</name>
              <description>Cancellation Finished of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF18" -->
            <field>
              <name>CF18</name>
              <description>Cancellation Finished of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF17" -->
            <field>
              <name>CF17</name>
              <description>Cancellation Finished of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF16" -->
            <field>
              <name>CF16</name>
              <description>Cancellation Finished of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF15" -->
            <field>
              <name>CF15</name>
              <description>Cancellation Finished of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF14" -->
            <field>
              <name>CF14</name>
              <description>Cancellation Finished of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF13" -->
            <field>
              <name>CF13</name>
              <description>Cancellation Finished of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF12" -->
            <field>
              <name>CF12</name>
              <description>Cancellation Finished of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF11" -->
            <field>
              <name>CF11</name>
              <description>Cancellation Finished of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF10" -->
            <field>
              <name>CF10</name>
              <description>Cancellation Finished of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF9" -->
            <field>
              <name>CF9</name>
              <description>Cancellation Finished of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF8" -->
            <field>
              <name>CF8</name>
              <description>Cancellation Finished of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF7" -->
            <field>
              <name>CF7</name>
              <description>Cancellation Finished of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF6" -->
            <field>
              <name>CF6</name>
              <description>Cancellation Finished of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF5" -->
            <field>
              <name>CF5</name>
              <description>Cancellation Finished of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF4" -->
            <field>
              <name>CF4</name>
              <description>Cancellation Finished of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF3" -->
            <field>
              <name>CF3</name>
              <description>Cancellation Finished of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF2" -->
            <field>
              <name>CF2</name>
              <description>Cancellation Finished of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF1" -->
            <field>
              <name>CF1</name>
              <description>Cancellation Finished of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF0" -->
            <field>
              <name>CF0</name>
              <description>Cancellation Finished of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBTIE" -->
        <register>
          <name>TXBTIE</name>
          <description>Tx Buffer Transmission Interrupt Enable [BHW]</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIE31" -->
            <field>
              <name>TIE31</name>
              <description>Transmission Interrupt Enable of Tx Buffer 31</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE30" -->
            <field>
              <name>TIE30</name>
              <description>Transmission Interrupt Enable of Tx Buffer 30</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE29" -->
            <field>
              <name>TIE29</name>
              <description>Transmission Interrupt Enable of Tx Buffer 29</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE28" -->
            <field>
              <name>TIE28</name>
              <description>Transmission Interrupt Enable of Tx Buffer 28</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE27" -->
            <field>
              <name>TIE27</name>
              <description>Transmission Interrupt Enable of Tx Buffer 27</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE26" -->
            <field>
              <name>TIE26</name>
              <description>Transmission Interrupt Enable of Tx Buffer 26</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE25" -->
            <field>
              <name>TIE25</name>
              <description>Transmission Interrupt Enable of Tx Buffer 25</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE24" -->
            <field>
              <name>TIE24</name>
              <description>Transmission Interrupt Enable of Tx Buffer 24</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE23" -->
            <field>
              <name>TIE23</name>
              <description>Transmission Interrupt Enable of Tx Buffer 23</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE22" -->
            <field>
              <name>TIE22</name>
              <description>Transmission Interrupt Enable of Tx Buffer 22</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE21" -->
            <field>
              <name>TIE21</name>
              <description>Transmission Interrupt Enable of Tx Buffer 21</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE20" -->
            <field>
              <name>TIE20</name>
              <description>Transmission Interrupt Enable of Tx Buffer 20</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE19" -->
            <field>
              <name>TIE19</name>
              <description>Transmission Interrupt Enable of Tx Buffer 19</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE18" -->
            <field>
              <name>TIE18</name>
              <description>Transmission Interrupt Enable of Tx Buffer 18</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE17" -->
            <field>
              <name>TIE17</name>
              <description>Transmission Interrupt Enable of Tx Buffer 17</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE16" -->
            <field>
              <name>TIE16</name>
              <description>Transmission Interrupt Enable of Tx Buffer 16</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE15" -->
            <field>
              <name>TIE15</name>
              <description>Transmission Interrupt Enable of Tx Buffer 15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE14" -->
            <field>
              <name>TIE14</name>
              <description>Transmission Interrupt Enable of Tx Buffer 14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE13" -->
            <field>
              <name>TIE13</name>
              <description>Transmission Interrupt Enable of Tx Buffer 13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE12" -->
            <field>
              <name>TIE12</name>
              <description>Transmission Interrupt Enable of Tx Buffer 12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE11" -->
            <field>
              <name>TIE11</name>
              <description>Transmission Interrupt Enable of Tx Buffer 11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE10" -->
            <field>
              <name>TIE10</name>
              <description>Transmission Interrupt Enable of Tx Buffer 10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE9" -->
            <field>
              <name>TIE9</name>
              <description>Transmission Interrupt Enable of Tx Buffer 9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE8" -->
            <field>
              <name>TIE8</name>
              <description>Transmission Interrupt Enable of Tx Buffer 8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE7" -->
            <field>
              <name>TIE7</name>
              <description>Transmission Interrupt Enable of Tx Buffer 7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE6" -->
            <field>
              <name>TIE6</name>
              <description>Transmission Interrupt Enable of Tx Buffer 6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE5" -->
            <field>
              <name>TIE5</name>
              <description>Transmission Interrupt Enable of Tx Buffer 5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE4" -->
            <field>
              <name>TIE4</name>
              <description>Transmission Interrupt Enable of Tx Buffer 4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE3" -->
            <field>
              <name>TIE3</name>
              <description>Transmission Interrupt Enable of Tx Buffer 3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE2" -->
            <field>
              <name>TIE2</name>
              <description>Transmission Interrupt Enable of Tx Buffer 2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE1" -->
            <field>
              <name>TIE1</name>
              <description>Transmission Interrupt Enable of Tx Buffer 1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE0" -->
            <field>
              <name>TIE0</name>
              <description>Transmission Interrupt Enable of Tx Buffer 0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
